Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་སུམ་ཁྲི་སུམ་ཁྲིའོ། །
en: There will be eighty-four consecutive congregations, each of them gathering one hundred thirty thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཡོན་ཏན་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Guṇadharma will be born in a place called Endowed with Qualities.

source: ཡབ་ནི་ཡོན་ཏན་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Qualities of Splendor will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་ཅན་ཞེས་བྱའོ། །
en: Endowed with Qualities will be his mother.

source: སྲས་ནི་ཡོན་ཏན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་ཆེན་པོའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Great Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གཟི་བརྗིད་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Splendid Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐར་པའི་ཡོན་ཏན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Qualities of Liberation will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be thirty-three consecutive congregations, each of them gathering seven billion.

source: དེ་བཞིན་གཤེགས་པ་ཞིང་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Laḍitakṣetra will be born in a place called Great Array.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཉི་ཤུ་ཙམ་མོ། །
en: His light will extend as far as twenty worlds of four continents.

source: ཡབ་ནི་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: Jewel Light will be his father.

source: ཡུམ་ནི་མཐའ་ཡས་ཞིང་ཞེས་བྱའོ། །
en: Infinite will be his mother.

source: སྲས་ནི་ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of Insight will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེས་རབ་གསལ་ཞེས་བྱའོ། །
en: Clear Insight will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐར་མཁན་འོད་ཅེས་བྱའོ། །
en: Radiant Astrologer will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Array will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དྲུག་འབུམ་དྲུག་འབུམ་མོ། །
en: There will be sixty-nine consecutive congregations, each of them gathering six hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་བཀོད་པའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vyūharāja will be born in a place called Jewel Array.

source: ཡབ་ནི་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱའོ། །
en: Inconceivable Array will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་རྫོགས་ལྡན་ཞེས་བྱའོ། །
en: Perfect Splendor will be his mother.

source: སྲས་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Array will be his son.

source: རིམ་གྲོ་པ་ནི་ཐར་པ་བཀོད་པ་ཞེས་བྱའོ། །
en: Array of Liberation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷའི་ཉི་མ་ཞེས་བྱའོ། །
en: Divine Sun will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: Immutable Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be seventy consecutive congregations, each of them gathering eight million.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་མངོན་པར་འཕགས་པ་སྐྱེ་བའི་ཡུལ་ནི་ལྷ་བརྩེགས་ཞེས་བྱའོ། །
en: “The thus-gone Abhyudgata will be born in a place called Divine Mound.

source: ཡུམ་ནི་འོད་ཟེར་མཆོག་ཅེས་བྱའོ། །
en: Supreme Radiance will be his mother.

source: སྲས་ནི་ཁེངས་མེད་ཅེས་བྱའོ། །
en: Without Conceit will be his son.

source: རིམ་གྲོ་པ་ནི་དབང་པོ་ཞི་ཞེས་བྱའོ། །
en: Serene Faculties will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་ལྷའི་བུ་དགའ་ཞེས་བྱའོ། །
en: Joyous Child of the Wealth God will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་འདོད་ཅེས་བྱའོ། །
en: Merit Wish will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་རེ་རེའོ། །
en: There will be ten consecutive congregations, each of them gathering two hundred million.

source: དེ་བཞིན་གཤེགས་པ་སྦྱིན་སྲེག་འོད་འཕྲོ་སྐྱེ་བའི་ཡུལ་ནི་ཚངས་པའི་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Hutārci will be born in a place called Brahmā Crest.

source: ཡབ་ནི་དྲང་སྲོང་བློ་ཞེས་བྱའོ། །
en: Sage Intelligence will be his father.

source: ཡུམ་ནི་སེམས་གྲོལ་མ་ཞེས་བྱའོ། །
en: Liberated Mind will be his mother.

source: སྲས་ནི་ཐེ་ཚོམ་མེད་ཅེས་བྱའོ། །
en: Free from Doubt will be his son.

source: རིམ་གྲོ་པ་ནི་དུལ་བར་གནས་ཞེས་བྱའོ། །
en: Abiding by the Training will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔའ་སྤྱོད་ཅེས་བྱའོ། །
en: Heroic Action will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱ་མཚོའི་ཏོག་ཅེས་བྱའོ། །
en: Ocean Crest will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་དགུ་བཅུ་དགུའོ། །
en: There will be eighty-five consecutive congregations, each of them gathering one hundred ninety million.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་དཔལ་སྐྱེ་བའི་ཡུལ་ནི་པད་མ་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Padmaśrī will be born in a place called Endowed with Lotuses.

source: ཡུམ་ནི་པད་མའི་མིག་ཅེས་བྱའོ། །
en: Lotus Eye will be his mother.

source: སྲས་ནི་མེ་ཏོག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Flower King will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་མ་ཡིན་གྱི་ལྷ་ཞེས་བྱའོ། །
en: God of Demigods will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེམས་ཅན་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Leader of Sentient Beings will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be twenty-seven consecutive congregations, each of them gathering eight hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་དགུ་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-nine thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དགུ་ཁྲི་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for ninety-nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་བཀོད་པ་སྐྱེ་བའི་ཡུལ་ནི་ལྷའི་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnavyūha will be born in a place called Divine Array.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུམ་ཅུ་ཙམ་མོ། །
en: His light will extend as far as thirty worlds of four continents.

source: ཡུམ་ནི་བློ་གྲོས་གསལ་ཞེས་བྱའོ། །
en: Clear Intelligence will be his mother.

source: སྲས་ནི་གསལ་ཆེན་ཞེས་བྱའོ། །
en: Great Clarity will be his son.

source: རིམ་གྲོ་པ་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Array will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་སེམས་ཞེས་བྱའོ། །
en: Dharma Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐར་པ་དགའ་ཞེས་བྱའོ། །
en: Liberation Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་བདུན་བཅུ་བདུན་ནོ། །
en: There will be seventy-five consecutive congregations, each of them gathering one hundred seventy million.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་བཟང་པོ་བྱེད་ཅེས་བྱའོ། །
en: “The thus-gone Subhadra will be born in a place called Doing Good.

source: ཡུམ་ནི་འཕགས་བཟང་མ་ཞེས་བྱའོ། །
en: Superior Excellence will be his mother.

source: སྲས་ནི་དཔལ་བཟང་ཞེས་བྱའོ། །
en: Glorious Excellence will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Jewels will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་པོ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Excellence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཚོན་ཆ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Weapon will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be forty-nine consecutive congregations, each of them gathering five million.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnottama will be born in a place called Great Jewel.

source: ཡབ་ནི་ཁྱེའུ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Boy will be his father.

source: ཡུམ་ནི་རིན་ཆེན་ཏོག་ཅེས་བྱའོ། །
en: Jewel Crest will be his mother.

source: སྲས་ནི་རིན་པོ་ཆེའི་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Jewel Ocean will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Jewels will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བྱང་ཆུབ་སྟོབས་ཞེས་བྱའོ། །
en: Strength of Awakening will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be eighty consecutive congregations, each of them gathering eight hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཐུགས་ཤིན་ཏུ་གཞུངས་པ་སྐྱེ་བའི་ཡུལ་ནི་ལྷུན་པོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Sumedhas will be born in a place called Great Mountain.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུ་རྩ་གསུམ་མོ། །
en: His light will extend seventy-three leagues.

source: ཡབ་ནི་རིན་པོ་ཆེའི་ལྷུན་པོ་ཞེས་བྱའོ། །
en: Jewel Mountain will be his father.

source: ཡུམ་ནི་རིན་ཆེན་ཆེན་མོ་ཞེས་བྱའོ། །
en: Great Jewel will be his mother.

source: སྲས་ནི་བདུད་རྩིའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Mass of Nectar will be his son.

source: རིམ་གྲོ་པ་ནི་དགེ་བ་བརྩེགས་ཞེས་བྱའོ། །
en: Piled Virtues will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རི་བོའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Shining Mountain will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོགས་པ་མེད་པར་གནས་ཞེས་བྱའོ། །
en: Remaining Unimpeded will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་དཔག་ཏུ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Amitābha will be born in a place called Immeasurable Splendor.

source: ཡབ་ནི་དོན་སེམས་ཞེས་བྱའོ། །
en: Meaningful Mind will be his father.

source: ཡུམ་ནི་སྡེ་ཆེན་མ་ཞེས་བྱའོ། །
en: Great Force will be his mother.

source: སྲས་ནི་གྲགས་པ་འཕགས་ཞེས་བྱའོ། །
en: Superior Fame will be his son.

source: རིམ་གྲོ་པ་བློ་གྲོས་ཉེ་བར་ཞི་ཞེས་བྱའོ། །
en: Serene Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྨོན་ལམ་གཟུངས་ཞེས་བྱའོ། །
en: Aspiration and Retention will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྟག་ཏུ་རྣམ་པར་འཕྲུལ་ཞེས་བྱའོ། །
en: Constant Miracles will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be eighty-four consecutive congregations, each of them gathering eight hundred forty million.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་ལྔའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty million years.

source: རྒྱལ་བ་རྒྱ་མཚོས་བྱིན་པ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་རྒྱ་མཚོ་མཐའ་ཡས་པ་ཞེས་བྱ། །
en: “The victorious Samudradatta Will be born in a place called Infinite Ocean.

source: རྡུལ་བྲལ་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །
en: The family of this immaculate one will be kṣatriya,

source: དཔག་ཚད་སུམ་སྟོང་ཐོས་པའི་དབང་པོ་ཡབ། །ཡོན་ཏན་ཚོགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: And his light will extend three thousand leagues. “Lord of Learning will be his father, and Gathering of Qualities will be this victor’s mother.

source: སྲས་པོ་ལེགས་མཐོང་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Fierce his attendant.

source: མཆོད་རྟེན་བཅུ་པ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Ten Stūpas will be the scholar

source: རྒྱ་མཚོའི་བློ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Ocean Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ལྷུན་པོའི་རྩེ་ལྟར་གཡོ་བ་མེད་པ་པོ། །ཐེར་འབུམ་ཐེར་འབུམ་སྙེད་ནི་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering one billion Who are unshakable, like the summits of mountains.

source: དངོས་པོ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །
en: “And the sacred Dharma of the one who has gone beyond entities

source: ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་སྟོང་དུ་གནས། །
en: Will remain for ten billion years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །
en: The relics of this victor will be abundant,

source: མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་དགུ་བཅུ་དྲུག །
en: And the fine stūpas will number nine hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་སྒྲོན་ཞེས་བྱ། །
en: “The thus-gone Brahmaketu Will be born in a place called Lamp of Wisdom.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །གྲགས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Excellent Brahmā will be his father, and Supreme Fame will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་བློ་བཟངས་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Excellent Mind his attendant.

source: ཚོགས་ལྡན་མཆོད་རྟེན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Stūpa Endowed with Gathering will be the scholar

source: ཚངས་པ་རྣམ་པར་ལྟ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Brahmā View the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྣམ་པར་ཐར་བརྒྱད་ཐོབ་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred thirty million Meditators who have attained the eight liberations.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And this thus-gone one’s sacred Dharma Will also remain for seventy-two thousand years.

source: མཆོད་རྟེན་བཟང་པོ་ཐེར་འབུམ་ཕྲག་གསུམ་ཡོད། །
en: And the fine stūpas will number three billion.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་གདུགས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་འོད་དག་འཕྲོ་བས་བརྒྱན་ཅེས་བྱ། །
en: “The thus-gone Somacchattra Will be born in a place called Adorned with Radiant Light.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་དྲན་ལྡན་ཡིན། །གདངས་མཐོ་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །སྒྲ་གཅན་འཛིན་ཡིན་རིགས་ལྡན་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend three leagues. “Mindful will be his father, and High Tone will be this victor’s mother. Rāhu Holder will be his son and Class Possessor his attendant.

source: ཡེ་ཤེས་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Wisdom Joy will be the scholar

source: སྲེད་པ་རྣམ་པར་སྐེམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Drier of Craving the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །གཡོ་མེད་རིམས་ནད་མེད་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be ten consecutive congregations, Each of them gathering nine hundred ninety million Meditators who are free from deceit and the plagues.

source: སྟོན་པ་འགོག་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ཡི་བར་དུ་གནས། །
en: “And when this teacher has proceeded to cessation His sacred Dharma will remain for ten thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: The relics of this victor will be contained in a single stūpa Measuring five leagues and adorned with gold.

source: འཇིག་རྟེན་མགོན་པོ་འོད་ནི་འཕྲོ་བ་ཡི། །སྐྱེ་ཡུལ་ལེགས་པར་གསུངས་དང་ལྡན་ཞེས་བྱ། །
en: “The protector of the world, Arciṣmat, Will be born in a place called Endowed with Excellent Statements.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་འོད་བྱེད་ཡིན། །ཏོག་གི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Shining will be his father, and Crest of Light will be this victor’s mother.

source: སྲས་པོ་བཀྲ་ཤིས་ཚོགས་དབང་རིམ་གྲོ་པ། །
en: Auspicious will be his son and Lord of the Gathering his attendant.

source: བཟང་པོ་གྲགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Famed Excellence will be the scholar

source: འཇིགས་པ་མེད་པར་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed for Fearlessness the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །སོ་སོ་ཡང་དག་རིག་པའི་ཕ་མཐར་ཕྱིན། །རྣམ་གྲོལ་མི་སློབ་འབྲས་ལྡན་ཤ་སྟག་གོ། །
en: “There will be sixty consecutive congregations, Consisting exclusively of those who have perfected correct knowledge And attained the fruition of liberation beyond training.

source: ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: Will remain for thirty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་ཐེར་འབུམ་ཕྲག་ནི་སུམ་ཅུ་གཉིས། །
en: The relics of this victor will be abundant, Contained in thirty-two billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འོད་ཅེས་བྱ། །
en: “The thus-gone Vimalarāja Will be born in a place called Light of Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་གཉིས་ཡོད་ཡབ་ནི་དཔལ་བཟངས་ཡིན། །བདུད་རྩི་དགའ་བ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །སེང་གེའི་འགྲོས་ཡིན་ལྷ་ལྡན་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend seventy-two leagues. “Excellent Glory will be his father, and Nectar Joy will be this victor’s mother. Lion Mode will be his son and Divine Endowment his attendant.

source: ཡོན་ཏན་འབྱུང་གནས་ཤེས་རབ་ཆེན་པོ་སྟེ། །
en: Source of Qualities will be the one of great insight

source: རྣམ་པར་བལྟ་བའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Wisdom of the View the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དྲང་སྲོང་ཐམས་ཅད་དགྲ་བཅོམ་མཚུངས་པ་པོ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering one billion Sages who are at the level of a worthy one.

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And for the benefit of wandering beings The sacred Dharma will remain for twenty-two thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཅུ་ཙམ་པ། །རིན་ཆེན་རྒྱལ་མཚན་སྟོང་གིས་མཛེས་པར་བྱས། །
en: The stūpa of this victor will measure ten leagues And be adorned with a thousand jewel banners.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པའི་འོད་ཅེས་བྱ། །
en: “The thus-gone Jñānakīrti Will be born in a place called Light of Fame.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །ལྷ་ཡི་མཆོད་རྟེན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Free from Suffering will be his father, and Divine Stūpa will be this victor’s mother.

source: སྲས་པོ་ཤེས་ལྡན་གྲགས་ལྡན་རིམ་གྲོ་པ། །
en: Knowledgeable will be his son and Renowned his attendant.

source: ཕྱོགས་རྣམས་བལྟ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Viewing the Positions will be the scholar

source: འདུས་པ་ལན་གྲངས་བཅྭ་ལྔ་ཀུན་ལ་ཡང་། །རྣམ་ཐར་བརྒྱད་ལ་གནས་པ་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be fifteen consecutive congregations, Each of them gathering seven hundred fifty million Who have achieved abiding within the eight liberations.

source: མི་མཆོག་ཏིང་འཛིན་ཐོབ་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་བདུན་ཅུ་དྲུག་ཏུ་གནས། །
en: “And the sacred Dharma of this supreme human attainer of absorption Will remain for seven hundred sixty million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་སུམ་ཅུ་དྲུག །
en: The relics of this victor will be abundant, And the stūpas will number three hundred sixty billion.

source: མི་ཡི་མཆོག་མ་ཀུན་ལས་རྒྱལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བདེན་པའི་འོད་ཅེས་བྱ། །
en: “The supreme human, Saṃjaya, Will be born in a place called Light of Truth.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལག་བཟངས་ཡིན། །ཡོན་ཏན་རྒྱ་མཚོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Excellent Hands will be his father, and Ocean of Qualities will be this victor’s mother.

source: སྲས་པོ་བདེན་ལྡན་བདེན་ལེགས་རིམ་གྲོ་པ། །
en: Possessor of Truth will be his son and Excellent Truth his attendant.

source: འཕགས་པ་དགྱེས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Delighting the Noble will be the scholar

source: ལག་མཆོག་བཟང་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Excellent Supreme Hand the one of miracles.

source: འདུས་པ་ལན་གྲངས་གཉིས་ཏེ་གཉིས་ཀ་ལའང་། །ནམ་མཁའི་དབྱིངས་ལ་རླུང་ལྟར་ཆགས་མེད་པ། །ཁྲི་ཕྲག་བཅུ་བཅུ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be two consecutive congregations, Both of them gathering one hundred thousand Who are free from attachment, like the wind in the sky.

source: འཁྲུགས་པ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་བཞིའི་བར་དུ་གནས། །
en: “And the sacred Dharma of this immutable one Will remain for fourteen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་གསེར་གྱི་བླ་རེར་ལྡན། །
en: There will be a single relic of this victor Contained in a stūpa five leagues large and adorned with golden canopies.

source: སངས་རྒྱས་ཡོན་ཏན་འོད་ནི་སྐྱེ་བའི་ཡུལ། །ཡོན་ཏན་ཀུན་གྱི་རྒྱ་མཚོ་ཞེས་ཀྱང་བྱ། །
en: “The buddha Guṇaprabha Will be born in a place called Ocean of All Qualities.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་ལེགས་མཆོག་ཡིན། །བློ་གསལ་རྒྱལ་ཡུམ་སྲས་པོ་ཡོན་ཏན་ཚོགས། །ཡོན་ཏན་འོད་ཅེས་བྱ་བ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Supreme Excellence will be his father, and Clear Mind will be this victor’s mother. Gathering of Qualities will be his son and Luminous Qualities his attendant.

source: ཡོན་ཏན་དག་གིས་བརྒྱན་པ་མཁས་པ་སྟེ། །
en: Adorned with Qualities will be the scholar

source: ཡོན་ཏན་རྫུ་འཕྲུལ་མཐའ་ཡས་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Miraculous Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཉིས་ཀུན་ལ་ཡང་། །ཆགས་པ་མེད་པར་གྱུར་པ་སེམས་སྦྱངས་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be twelve consecutive congregations, Each of them gathering three hundred twenty million Who have purified their minds and become free from attachment.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་ཉི་ཁྲི་ཡིན། །
en: The lifespan of humans will be twenty thousand years,

source: མིག་གི་སྦྱིན་པ་མཛད་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this granter of the gift of sight Will remain for twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་ཐམས་ཅད་རིན་ཆེན་ཡིན། །
en: There will be a single relic of this victor Contained in a stūpa eight leagues large and made entirely of jewels.

source: རྒྱལ་བ་སྒྲ་ནི་རྣམ་པར་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་ཅན་ཞེས་བྱ། །
en: “The victorious Vighuṣṭaśabda Will be born in a place called Endowed with Fame.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ནོར་གྲགས་ཡིན། །བློ་གྲོས་གྲགས་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Famed Wealth will be his father, and Famed Intelligence will be this victor’s mother.

source: སྲས་པོ་གྲགས་ལྡན་ལྷ་ལེགས་རིམ་གྲོ་པ། །
en: Endowed with Fame will be his son and Divine Excellence his attendant.

source: ལྷ་ཡི་དབྱངས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Divine Melody will be the scholar

source: རྣམ་པར་གྲགས་པའི་ཀླུ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Nāga the one of miracles.

source: འདུས་པ་ལན་གྲངས་གསུམ་སྟེ་ཀུན་ལ་ཡང་། །རི་བོའི་ལྷུན་ལྟར་གཡོ་བ་མེད་པ་པོ། །དེ་དག་ཐེར་འབུམ་ཐེར་འབུམ་འབྱུང་བར་འགྱུར། །
en: “There will be three consecutive congregations, Each of them gathering one billion Who are unshakable like majestic mountains.

source: གྲགས་པ་མཐའ་ཡས་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་སྙེད་གནས་པར་འགྱུར། །
en: “And after the one of infinite fame has attained nirvāṇa His sacred Dharma will remain for thousands of years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་སྟེ། །རིན་ཆེན་མཆོག་རབ་བདུན་པོའི་རང་བཞིན་ཡིན། །
en: The stūpa of this victor will be three leagues large And made of the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་རྒྱས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་འོད་ཅེས་བྱ། །
en: “The thus-gone one Pūrṇacandra Will be born in a place called Radiant Crest.
